[
  {
    "id": 1,
    "projectTitle": "Urban Eats",
    "projectImg": "https://i.ibb.co/kMFj56T/urban-eats.png",
    "projectDescription": "This is a restaurant website.I mainly focused on the front-end part as I am a front-end developer right now. I am continuously working on this project to implement the best features that I can. My main goal for this project is to create a full-stack application using the MERN stack and to develop reusable components to use multiple times throughout the website.",
    "usedTools": [
      "React JS",
      "Tailwind CSS",
      "Daisy UI",
      "React Router DOM",
      "React Icons"
    ],
    "startDate": "Feb 10, 2024",
    "endDate": "Will Be Updated",
    "githubLink": "https://github.com/Shahriar090/Urban-Eats",
    "liveDemo": "https://urban-eats-restaurent.netlify.app"
  },
  {
    "id": 2,
    "projectTitle": "Top Toolz",
    "projectImg": "https://i.ibb.co/CVyQ1KZ/top-toolz.png",
    "projectDescription": "This is a tools-related simple landing page. I mainly focused on the front-end part as I am a front-end developer right now. I am continuously working on this project to implement the best features that I can. My main goal for this project is to create a full-stack application using the MERN stack and to develop reusable components to use multiple times throughout the website.",
    "usedTools": ["React JS", "Tailwind CSS", "React Icons"],
    "startDate": "Mar 22, 2024",
    "endDate": "Will Be Updated",
    "githubLink": "https://github.com/Shahriar090/top-toolz",
    "liveDemo": "https://top-toolz.netlify.app"
  },
  {
    "id": 3,
    "projectTitle": "My Portfolio",
    "projectImg": "https://i.ibb.co/nCjm402/Screenshot-2024-04-23-204025.png",
    "projectDescription": "This is my personal portfolio website, where I showcase my work and demonstrate my expertise in front-end development. As a dedicated front-end developer, I am committed to staying abreast of industry trends and continuously learning new technologies. By embracing best practices such as creating reusable components and maintaining clean code, I strive to deliver high-quality projects. Currently, I am focused on expanding my skill set to encompass full-stack development using the MERN stack. I approach each project with enthusiasm and a drive to refine my abilities, ensuring that my work remains innovative and competitive in today's dynamic tech landscape.",
    "usedTools": [
      "React JS",
      "Tailwind CSS",
      "Daisy UI",
      "React Icons",
      "React Router DOM"
    ],
    "startDate": "Mar 22, 2024",
    "endDate": "Will Be Updated",
    "githubLink": "https://github.com/Shahriar090/my-portfolio-2",
    "liveDemo": "https://dev-shahriar.netlify.app"
  }
]
